tutorials/lagrangian/kinematicParcelFoam/windshield/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    //back
    ( 0   0   0.25)
    ( 1   0   0.25)
    ( 1  0.5  0)
    ( 0  0.5  0)

    // front
    ( 0   0   0.5)
    ( 1   0   0.5)
    ( 1  0.5  0.5)
    ( 0  0.5  0.5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7 ) (200 100 10) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    sides
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 4 7 3)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    windshield
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
