tutorials/lagrangian/kinematicParcelFoam/windshield/constant/regionFaIBMProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      IBMProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

IBM1
{
    surface             "<constant>/surface.obj";

    solidBodyMotionFunction rotatingMotion;

    origin              (0.5 0 0);
    axis                (0 0 1);
    omega               sine;
    frequency           0.5;
    amplitude           1;
    t0                 -1;

    // A scalar Function1
    scale               0.8;
    level               0;
}

IBM2
{
    surface             "<constant>/surface_offset.obj";

    solidBodyMotionFunction rotatingMotion;

    origin              (0.65 0 0);
    axis                (0 0 1);
    omega               sine;
    frequency           0.5;
    amplitude           1;
    t0                 -1;

    // A scalar Function1
    scale               0.8;
    level               0;
}

// ************************************************************************* //
