tutorials/lagrangian/kinematicParcelFoam/windshield/system/finite-area/faMeshDefinition
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      faMeshDefinition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

polyMeshPatches  ( wall );

boundary
{
    sides
    {
        type                patch;
        neighbourPolyPatch  sides;
    }

    windshield
    {
        type                patch;
        neighbourPolyPatch  windshield;
    }
}


defaultPatch
{
    name        empty;
    type        empty;
}


// ************************************************************************** //
