tutorials/lagrangian/kinematicParcelFoam/windshield/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication makeFaMesh

runApplication decomposePar # -no-finite-area

runParallel $(getApplication)

#------------------------------------------------------------------------------
